#Pandas2

# Filtering & Conditional Selection in Pandas

In [2]:
import pandas as pd

data = {
    'Name': ['Alice', 'Bob', 'Charlie', 'David'],
    'Age': [24, 27, 22, 29],
    'City': ['New York', 'Paris', 'London', 'Paris']
}

df = pd.DataFrame(data)

In [3]:
#Filter rows using a condition
df[df['Age'] > 25]

    Name  Age   City
1    Bob   27  Paris
3  David   29  Paris

In [7]:
#Multiple Conditions (AND / OR)
print(df[(df['Age'] > 25) & (df['City'] == 'Paris')])
print("\n-----\n")
print(df[(df['City'] == 'London') | (df['City'] == 'Paris')])

    Name  Age   City
1    Bob   27  Paris
3  David   29  Paris

-----

      Name  Age    City
1      Bob   27   Paris
2  Charlie   22  London
3    David   29   Paris

In [8]:
#Filter rows using isin()
df[df['City'].isin(['Paris', 'London'])]
#Example: Cities in a list

      Name  Age    City
1      Bob   27   Paris
2  Charlie   22  London
3    David   29   Paris

In [9]:
#Filter rows using ~ (NOT operator)
df[~(df['City'] == 'Paris')]
#Example: People not in Paris

      Name  Age      City
0    Alice   24  New York
2  Charlie   22    London

In [10]:
#Filter using str conditions (for text)

#Example: Names that start with "A"
print(df[df['Name'].str.startswith('A')])

#Example: Cities that contain "on"
print(df[df['City'].str.contains('on')])

    Name  Age      City
0  Alice   24  New York
      Name  Age    City
2  Charlie   22  London

# Adding & Removing Columns in Pandas

In [11]:
import pandas as pd

data = {
    'Name': ['Alice', 'Bob', 'Charlie'],
    'Age': [24, 27, 22],
    'City': ['New York', 'Paris', 'London']
}

df = pd.DataFrame(data)

In [16]:
# Add a New Column

#Add a constant value
df['Country'] = 'USA' #Adds a column with the value 'USA' for all rows.
print("\n ---- \n")

#Add a column using a list
df['Score'] = [85, 90, 78]
print("\n ---- \n")

#Add a column using an operation on existing columns
df['Age in 5 Years'] = df['Age'] + 5

print(df)

 ----


 ----

      Name  Age      City Country  Score  Age in 5 Years
0    Alice   24  New York     USA     85              29
1      Bob   27     Paris     USA     90              32
2  Charlie   22    London     USA     78              27

In [18]:
# Modify an Existing Column
df['Age'] = df['Age'] + 1
df['Age in 5 Years'] = df['Age in 5 Years'] + 1
#Updates all values in the 'Age' column.
print(df)

      Name  Age      City Country  Score  Age in 5 Years
0    Alice   26  New York     USA     85              30
1      Bob   29     Paris     USA     90              33
2  Charlie   24    London     USA     78              28

In [20]:
#3. Delete/Drop a Column

#Drop a single column
df = df.drop('Score', axis=1)#axis=1 means you're dropping a column (use axis=0 for rows).
print(df)

print("\n ---- \n")

#Drop multiple columns
df = df.drop(['Country', 'Age in 5 Years'], axis=1)
print(df)

      Name  Age      City Country  Age in 5 Years
0    Alice   26  New York     USA              30
1      Bob   29     Paris     USA              33
2  Charlie   24    London     USA              28

 ----

      Name  Age      City
0    Alice   26  New York
1      Bob   29     Paris
2  Charlie   24    London

In [3]:
#Pop a Column (Remove and get it)
import pandas as pd

# Sample DataFrame
df = pd.DataFrame({
    'Name': ['Alice', 'Bob', 'Charlie'],
    'Age': [20, 22, 19],
    'Score': [85, 90, 78]
})

print("Modified DataFrame:\n", df)

# Pop the 'Score' column
score_col = df.pop('Score')

print("\nPopped column (Score):\n", score_col)
# Removes and stores the column in a variable

Modified DataFrame:
       Name  Age  Score
0    Alice   20     85
1      Bob   22     90
2  Charlie   19     78

Popped column (Score):
 0    85
1    90
2    78
Name: Score, dtype: int64

In [25]:
#Insert Column at Specific Position
# Sample DataFrame
df = pd.DataFrame({
    'Name': ['Alice', 'Bob', 'Charlie'],
    'Age': [20, 22, 19],
    'Score': [85, 90, 78]
})
df.insert(1, 'Gender', ['F', 'M', 'M'])
print(df)
#Inserts the column at position 1 (after 'Name')

      Name Gender  Age  Score
0    Alice      F   20     85
1      Bob      M   22     90
2  Charlie      M   19     78

#  Renaming Columns in Pandas

In [26]:
import pandas as pd

data = {
    'Name': ['Alice', 'Bob', 'Charlie'],
    'Age': [24, 27, 22],
    'City': ['New York', 'Paris', 'London']
}

df = pd.DataFrame(data)

In [28]:
#Rename a Single Column,Use the rename() method with a dictionary.
df = df.rename(columns={'Name': 'Full Name'})
print(df)

  Full Name  Age      City
0     Alice   24  New York
1       Bob   27     Paris
2   Charlie   22    London

In [29]:
#Rename Multiple Columns
df = df.rename(columns={
    'Age': 'Years',
    'City': 'Location'
})
print(df)

#Rename All Columns at Once
df.columns = ['Name', 'Age', 'City']
print("\n", df)   #This replaces all column names at once (must match the number of columns).

#Rename Rows (Index)
df = df.rename(index={0: 'first', 1: 'second'})
print("\n", df)  #Changes row index labels.

#Rename with str functions (e.g. lowercase)
df.columns = df.columns.str.lower()
print("\n", df)  #Makes all column names lowercase: ['name', 'age', 'city']

  Full Name  Years  Location
0     Alice     24  New York
1       Bob     27     Paris
2   Charlie     22    London

       Name  Age      City
0    Alice   24  New York
1      Bob   27     Paris
2  Charlie   22    London

            Name  Age      City
first     Alice   24  New York
second      Bob   27     Paris
2       Charlie   22    London

            name  age      city
first     Alice   24  New York
second      Bob   27     Paris
2       Charlie   22    London